hazy1k/CW32-48L/2.开发环境/CW32L031_StdPeriph_Lib（固件库）/Libraries/inc/cw32l031_gpio.h
#define PF00_PDR_ENABLE()                   (CW_GPIOF->PDR_f.PIN0  = 1)
#define PF00_PDR_DISABLE()                  (CW_GPIOF->PDR_f.PIN0  = 0)
#define PF01_PDR_ENABLE()                   (CW_GPIOF->PDR_f.PIN1  = 1)
#define PF01_PDR_DISABLE()                  (CW_GPIOF->PDR_f.PIN1  = 0)
#define PF06_PDR_ENABLE()                   (CW_GPIOF->PDR_f.PIN6  = 1)
#define PF06_PDR_DISABLE()                  (CW_GPIOF->PDR_f.PIN6  = 0)
#define PF07_PDR_ENABLE()                   (CW_GPIOF->PDR_f.PIN7  = 1)
#define PF07_PDR_DISABLE()                  (CW_GPIOF->PDR_f.PIN7  = 0)

//============================================================
// GETVALUE
#define PA00_GETVALUE()                     (CW_GPIOA->IDR & bv0)
#define PA01_GETVALUE()                     (CW_GPIOA->IDR & bv1)
#define PA02_GETVALUE()                     (CW_GPIOA->IDR & bv2)
#define PA03_GETVALUE()                     (CW_GPIOA->IDR & bv3)
#define PA04_GETVALUE()                     (CW_GPIOA->IDR & bv4)
#define PA05_GETVALUE()                     (CW_GPIOA->IDR & bv5)
#define PA06_GETVALUE()                     (CW_GPIOA->IDR & bv6)
#define PA07_GETVALUE()                     (CW_GPIOA->IDR & bv7)
#define PA08_GETVALUE()                     (CW_GPIOA->IDR & bv8)
#define PA09_GETVALUE()                     (CW_GPIOA->IDR & bv9)
#define PA10_GETVALUE()                     (CW_GPIOA->IDR & bv10)
#define PA11_GETVALUE()                     (CW_GPIOA->IDR & bv11)
#define PA12_GETVALUE()                     (CW_GPIOA->IDR & bv12)
#define PA13_GETVALUE()                     (CW_GPIOA->IDR & bv13)
#define PA14_GETVALUE()                     (CW_GPIOA->IDR & bv14)
#define PA15_GETVALUE()                     (CW_GPIOA->IDR & bv15)

#define PB00_GETVALUE()                     (CW_GPIOB->IDR & bv0)
#define PB01_GETVALUE()                     (CW_GPIOB->IDR & bv1)
#define PB02_GETVALUE()                     (CW_GPIOB->IDR & bv2)
#define PB03_GETVALUE()                     (CW_GPIOB->IDR & bv3)
#define PB04_GETVALUE()                     (CW_GPIOB->IDR & bv4)
#define PB05_GETVALUE()                     (CW_GPIOB->IDR & bv5)
#define PB06_GETVALUE()                     (CW_GPIOB->IDR & bv6)
#define PB07_GETVALUE()                     (CW_GPIOB->IDR & bv7)
#define PB08_GETVALUE()                     (CW_GPIOB->IDR & bv8)
#define PB09_GETVALUE()                     (CW_GPIOB->IDR & bv9)
#define PB10_GETVALUE()                     (CW_GPIOB->IDR & bv10)
#define PB11_GETVALUE()                     (CW_GPIOB->IDR & bv11)
#define PB12_GETVALUE()                     (CW_GPIOB->IDR & bv12)
#define PB13_GETVALUE()                     (CW_GPIOB->IDR & bv13)
#define PB14_GETVALUE()                     (CW_GPIOB->IDR & bv14)
#define PB15_GETVALUE()                     (CW_GPIOB->IDR & bv15)

#define PC00_GETVALUE()                     (CW_GPIOC->IDR & bv0)
#define PC01_GETVALUE()                     (CW_GPIOC->IDR & bv1)
#define PC02_GETVALUE()                     (CW_GPIOC->IDR & bv2)
#define PC03_GETVALUE()                     (CW_GPIOC->IDR & bv3)
#define PC04_GETVALUE()                     (CW_GPIOC->IDR & bv4)
#define PC05_GETVALUE()                     (CW_GPIOC->IDR & bv5)
#define PC06_GETVALUE()                     (CW_GPIOC->IDR & bv6)
#define PC07_GETVALUE()                     (CW_GPIOC->IDR & bv7)
#define PC08_GETVALUE()                     (CW_GPIOC->IDR & bv8)
#define PC09_GETVALUE()                     (CW_GPIOC->IDR & bv9)
#define PC10_GETVALUE()                     (CW_GPIOC->IDR & bv10)
#define PC11_GETVALUE()                     (CW_GPIOC->IDR & bv11)
#define PC12_GETVALUE()                     (CW_GPIOC->IDR & bv12)
#define PC13_GETVALUE()                     (CW_GPIOC->IDR & bv13)
#define PC14_GETVALUE()                     (CW_GPIOC->IDR & bv14)
#define PC15_GETVALUE()                     (CW_GPIOC->IDR & bv15)

#define PF00_GETVALUE()                     (CW_GPIOF->IDR & bv0)
#define PF01_GETVALUE()                     (CW_GPIOF->IDR & bv1)
#define PF06_GETVALUE()                     (CW_GPIOF->IDR & bv6)
#define PF07_GETVALUE()                     (CW_GPIOF->IDR & bv7)

//============================================================
// SET HIGH AND LOW
#define PA00_SETHIGH()                      (CW_GPIOA->BSRR = bv0)
#define PA00_SETLOW()                       (CW_GPIOA->BRR  = bv0)
#define PA01_SETHIGH()                      (CW_GPIOA->BSRR = bv1)
#define PA01_SETLOW()                       (CW_GPIOA->BRR  = bv1)
#define PA02_SETHIGH()                      (CW_GPIOA->BSRR = bv2)
#define PA02_SETLOW()                       (CW_GPIOA->BRR  = bv2)
#define PA03_SETHIGH()                      (CW_GPIOA->BSRR = bv3)
#define PA03_SETLOW()                       (CW_GPIOA->BRR  = bv3)
#define PA04_SETHIGH()                      (CW_GPIOA->BSRR = bv4)
#define PA04_SETLOW()                       (CW_GPIOA->BRR  = bv4)
#define PA05_SETHIGH()                      (CW_GPIOA->BSRR = bv5)
#define PA05_SETLOW()                       (CW_GPIOA->BRR  = bv5)
#define PA06_SETHIGH()                      (CW_GPIOA->BSRR = bv6)
#define PA06_SETLOW()                       (CW_GPIOA->BRR  = bv6)
#define PA07_SETHIGH()                      (CW_GPIOA->BSRR = bv7)
#define PA07_SETLOW()                       (CW_GPIOA->BRR  = bv7)
#define PA08_SETHIGH()                      (CW_GPIOA->BSRR = bv8)
#define PA08_SETLOW()                       (CW_GPIOA->BRR  = bv8)
#define PA09_SETHIGH()                      (CW_GPIOA->BSRR = bv9)
#define PA09_SETLOW()                       (CW_GPIOA->BRR  = bv9)
#define PA10_SETHIGH()                      (CW_GPIOA->BSRR = bv10)
#define PA10_SETLOW()                       (CW_GPIOA->BRR  = bv10)
#define PA11_SETHIGH()                      (CW_GPIOA->BSRR = bv11)
#define PA11_SETLOW()                       (CW_GPIOA->BRR  = bv11)
#define PA12_SETHIGH()                      (CW_GPIOA->BSRR = bv12)
#define PA12_SETLOW()                       (CW_GPIOA->BRR  = bv12)
#define PA13_SETHIGH()                      (CW_GPIOA->BSRR = bv13)
#define PA13_SETLOW()                       (CW_GPIOA->BRR  = bv13)
#define PA14_SETHIGH()                      (CW_GPIOA->BSRR = bv14)
#define PA14_SETLOW()                       (CW_GPIOA->BRR  = bv14)
#define PA15_SETHIGH()                      (CW_GPIOA->BSRR = bv15)
#define PA15_SETLOW()                       (CW_GPIOA->BRR  = bv15)

#define PB00_SETHIGH()                      (CW_GPIOB->BSRR = bv0)
#define PB00_SETLOW()                       (CW_GPIOB->BRR  = bv0)
#define PB01_SETHIGH()                      (CW_GPIOB->BSRR = bv1)
#define PB01_SETLOW()                       (CW_GPIOB->BRR  = bv1)
#define PB02_SETHIGH()                      (CW_GPIOB->BSRR = bv2)
#define PB02_SETLOW()                       (CW_GPIOB->BRR  = bv2)
#define PB03_SETHIGH()                      (CW_GPIOB->BSRR = bv3)
#define PB03_SETLOW()                       (CW_GPIOB->BRR  = bv3)
#define PB04_SETHIGH()                      (CW_GPIOB->BSRR = bv4)
#define PB04_SETLOW()                       (CW_GPIOB->BRR  = bv4)
#define PB05_SETHIGH()                      (CW_GPIOB->BSRR = bv5)
#define PB05_SETLOW()                       (CW_GPIOB->BRR  = bv5)
#define PB06_SETHIGH()                      (CW_GPIOB->BSRR = bv6)
#define PB06_SETLOW()                       (CW_GPIOB->BRR  = bv6)
#define PB07_SETHIGH()                      (CW_GPIOB->BSRR = bv7)
#define PB07_SETLOW()                       (CW_GPIOB->BRR  = bv7)
#define PB08_SETHIGH()                      (CW_GPIOB->BSRR = bv8)
#define PB08_SETLOW()                       (CW_GPIOB->BRR  = bv8)
#define PB09_SETHIGH()                      (CW_GPIOB->BSRR = bv9)
#define PB09_SETLOW()                       (CW_GPIOB->BRR  = bv9)
#define PB10_SETHIGH()                      (CW_GPIOB->BSRR = bv10)
#define PB10_SETLOW()                       (CW_GPIOB->BRR  = bv10)
#define PB11_SETHIGH()                      (CW_GPIOB->BSRR = bv11)
#define PB11_SETLOW()                       (CW_GPIOB->BRR  = bv11)
#define PB12_SETHIGH()                      (CW_GPIOB->BSRR = bv12)
#define PB12_SETLOW()                       (CW_GPIOB->BRR  = bv12)
#define PB13_SETHIGH()                      (CW_GPIOB->BSRR = bv13)
#define PB13_SETLOW()                       (CW_GPIOB->BRR  = bv13)
#define PB14_SETHIGH()                      (CW_GPIOB->BSRR = bv14)
#define PB14_SETLOW()                       (CW_GPIOB->BRR  = bv14)
#define PB15_SETHIGH()                      (CW_GPIOB->BSRR = bv15)
#define PB15_SETLOW()                       (CW_GPIOB->BRR  = bv15)

