hazy1k/CW32-48L/2.开发环境/CW32L031_StdPeriph_Lib（固件库）/Libraries/inc/cw32l031_gpio.h
#define PC00_SETHIGH()                      (CW_GPIOC->BSRR = bv0)
#define PC00_SETLOW()                       (CW_GPIOC->BRR  = bv0)
#define PC01_SETHIGH()                      (CW_GPIOC->BSRR = bv1)
#define PC01_SETLOW()                       (CW_GPIOC->BRR  = bv1)
#define PC02_SETHIGH()                      (CW_GPIOC->BSRR = bv2)
#define PC02_SETLOW()                       (CW_GPIOC->BRR  = bv2)
#define PC03_SETHIGH()                      (CW_GPIOC->BSRR = bv3)
#define PC03_SETLOW()                       (CW_GPIOC->BRR  = bv3)
#define PC04_SETHIGH()                      (CW_GPIOC->BSRR = bv4)
#define PC04_SETLOW()                       (CW_GPIOC->BRR  = bv4)
#define PC05_SETHIGH()                      (CW_GPIOC->BSRR = bv5)
#define PC05_SETLOW()                       (CW_GPIOC->BRR  = bv5)
#define PC06_SETHIGH()                      (CW_GPIOC->BSRR = bv6)
#define PC06_SETLOW()                       (CW_GPIOC->BRR  = bv6)
#define PC07_SETHIGH()                      (CW_GPIOC->BSRR = bv7)
#define PC07_SETLOW()                       (CW_GPIOC->BRR  = bv7)
#define PC08_SETHIGH()                      (CW_GPIOC->BSRR = bv8)
#define PC08_SETLOW()                       (CW_GPIOC->BRR  = bv8)
#define PC09_SETHIGH()                      (CW_GPIOC->BSRR = bv9)
#define PC09_SETLOW()                       (CW_GPIOC->BRR  = bv9)
#define PC10_SETHIGH()                      (CW_GPIOC->BSRR = bv10)
#define PC10_SETLOW()                       (CW_GPIOC->BRR  = bv10)
#define PC11_SETHIGH()                      (CW_GPIOC->BSRR = bv11)
#define PC11_SETLOW()                       (CW_GPIOC->BRR  = bv11)
#define PC12_SETHIGH()                      (CW_GPIOC->BSRR = bv12)
#define PC12_SETLOW()                       (CW_GPIOC->BRR  = bv12)
#define PC13_SETHIGH()                      (CW_GPIOC->BSRR = bv13)
#define PC13_SETLOW()                       (CW_GPIOC->BRR  = bv13)
#define PC14_SETHIGH()                      (CW_GPIOC->BSRR = bv14)
#define PC14_SETLOW()                       (CW_GPIOC->BRR  = bv14)
#define PC15_SETHIGH()                      (CW_GPIOC->BSRR = bv15)
#define PC15_SETLOW()                       (CW_GPIOC->BRR  = bv15)

#define PF00_SETHIGH()                      (CW_GPIOF->BSRR = bv0)
#define PF00_SETLOW()                       (CW_GPIOF->BRR  = bv0)
#define PF01_SETHIGH()                      (CW_GPIOF->BSRR = bv1)
#define PF01_SETLOW()                       (CW_GPIOF->BRR  = bv1)
#define PF06_SETHIGH()                      (CW_GPIOF->BSRR = bv6)
#define PF06_SETLOW()                       (CW_GPIOF->BRR  = bv6)
#define PF07_SETHIGH()                      (CW_GPIOF->BSRR = bv7)
#define PF07_SETLOW()                       (CW_GPIOF->BRR  = bv7)


//============================================================
// TOG
#define PA00_TOG()                          (CW_GPIOA->TOG = bv0)
#define PA01_TOG()                          (CW_GPIOA->TOG = bv1)
#define PA02_TOG()                          (CW_GPIOA->TOG = bv2)
#define PA03_TOG()                          (CW_GPIOA->TOG = bv3)
#define PA04_TOG()                          (CW_GPIOA->TOG = bv4)
#define PA05_TOG()                          (CW_GPIOA->TOG = bv5)
#define PA06_TOG()                          (CW_GPIOA->TOG = bv6)
#define PA07_TOG()                          (CW_GPIOA->TOG = bv7)
#define PA08_TOG()                          (CW_GPIOA->TOG = bv8)
#define PA09_TOG()                          (CW_GPIOA->TOG = bv9)
#define PA10_TOG()                          (CW_GPIOA->TOG = bv10)
#define PA11_TOG()                          (CW_GPIOA->TOG = bv11)
#define PA12_TOG()                          (CW_GPIOA->TOG = bv12)
#define PA13_TOG()                          (CW_GPIOA->TOG = bv13)
#define PA14_TOG()                          (CW_GPIOA->TOG = bv14)
#define PA15_TOG()                          (CW_GPIOA->TOG = bv15)

#define PB00_TOG()                          (CW_GPIOB->TOG = bv0)
#define PB01_TOG()                          (CW_GPIOB->TOG = bv1)
#define PB02_TOG()                          (CW_GPIOB->TOG = bv2)
#define PB03_TOG()                          (CW_GPIOB->TOG = bv3)
#define PB04_TOG()                          (CW_GPIOB->TOG = bv4)
#define PB05_TOG()                          (CW_GPIOB->TOG = bv5)
#define PB06_TOG()                          (CW_GPIOB->TOG = bv6)
#define PB07_TOG()                          (CW_GPIOB->TOG = bv7)
#define PB08_TOG()                          (CW_GPIOB->TOG = bv8)
#define PB09_TOG()                          (CW_GPIOB->TOG = bv9)
#define PB10_TOG()                          (CW_GPIOB->TOG = bv10)
#define PB11_TOG()                          (CW_GPIOB->TOG = bv11)
#define PB12_TOG()                          (CW_GPIOB->TOG = bv12)
#define PB13_TOG()                          (CW_GPIOB->TOG = bv13)
#define PB14_TOG()                          (CW_GPIOB->TOG = bv14)
#define PB15_TOG()                          (CW_GPIOB->TOG = bv15)

#define PC00_TOG()                          (CW_GPIOC->TOG = bv0)
#define PC01_TOG()                          (CW_GPIOC->TOG = bv1)
#define PC02_TOG()                          (CW_GPIOC->TOG = bv2)
#define PC03_TOG()                          (CW_GPIOC->TOG = bv3)
#define PC04_TOG()                          (CW_GPIOC->TOG = bv4)
#define PC05_TOG()                          (CW_GPIOC->TOG = bv5)
#define PC06_TOG()                          (CW_GPIOC->TOG = bv6)
#define PC07_TOG()                          (CW_GPIOC->TOG = bv7)
#define PC08_TOG()                          (CW_GPIOC->TOG = bv8)
#define PC09_TOG()                          (CW_GPIOC->TOG = bv9)
#define PC10_TOG()                          (CW_GPIOC->TOG = bv10)
#define PC11_TOG()                          (CW_GPIOC->TOG = bv11)
#define PC12_TOG()                          (CW_GPIOC->TOG = bv12)
#define PC13_TOG()                          (CW_GPIOC->TOG = bv13)
#define PC14_TOG()                          (CW_GPIOC->TOG = bv14)
#define PC15_TOG()                          (CW_GPIOC->TOG = bv15)

#define PF00_TOG()                          (CW_GPIOF->TOG = bv0)
#define PF01_TOG()                          (CW_GPIOF->TOG = bv1)
#define PF06_TOG()                          (CW_GPIOF->TOG = bv6)
#define PF07_TOG()                          (CW_GPIOF->TOG = bv7)


//============================================================
// AF0 - AF7
#define PA00_AFx_GPIO()                     (CW_GPIOA->AFRL_f.AFR0  = 0)
#define PA00_AFx_UART3CTS()                 (CW_GPIOA->AFRL_f.AFR0  = 1)
#define PA00_AFx_UART2CTS()                 (CW_GPIOA->AFRL_f.AFR0  = 2)
#define PA00_AFx_RTCTAMP()                  (CW_GPIOA->AFRL_f.AFR0  = 3)
#define PA00_AFx_VC1OUT()                   (CW_GPIOA->AFRL_f.AFR0  = 4)
#define PA00_AFx_GTIM2CH1()                 (CW_GPIOA->AFRL_f.AFR0  = 6)
#define PA00_AFx_GTIM2ETR()                 (CW_GPIOA->AFRL_f.AFR0  = 7)
#define PA01_AFx_GPIO()                     (CW_GPIOA->AFRL_f.AFR1  = 0)
#define PA01_AFx_UART3RTS()                 (CW_GPIOA->AFRL_f.AFR1  = 1)
#define PA01_AFx_UART2RTS()                 (CW_GPIOA->AFRL_f.AFR1  = 2)
#define PA01_AFx_LVDOUT()                   (CW_GPIOA->AFRL_f.AFR1  = 4)
#define PA01_AFx_GTIM2CH2()                 (CW_GPIOA->AFRL_f.AFR1  = 6)
#define PA01_AFx_RTCTAMP()                  (CW_GPIOA->AFRL_f.AFR1  = 7)
#define PA02_AFx_GPIO()                     (CW_GPIOA->AFRL_f.AFR2  = 0)
#define PA02_AFx_UART3TXD()                 (CW_GPIOA->AFRL_f.AFR2  = 1)
#define PA02_AFx_UART2TXD()                 (CW_GPIOA->AFRL_f.AFR2  = 2)
#define PA02_AFx_VC2OUT()                   (CW_GPIOA->AFRL_f.AFR2  = 4)
#define PA02_AFx_GTIM2CH3()                 (CW_GPIOA->AFRL_f.AFR2  = 6)
#define PA02_AFx_AWTETR()                   (CW_GPIOA->AFRL_f.AFR2  = 7)
#define PA03_AFx_GPIO()                     (CW_GPIOA->AFRL_f.AFR3  = 0)
#define PA03_AFx_UART3RXD()                 (CW_GPIOA->AFRL_f.AFR3  = 1)
#define PA03_AFx_UART2RXD()                 (CW_GPIOA->AFRL_f.AFR3  = 2)
#define PA03_AFx_GTIM2CH2()                 (CW_GPIOA->AFRL_f.AFR3  = 3)
#define PA03_AFx_PCLKOUT()                  (CW_GPIOA->AFRL_f.AFR3  = 4)
#define PA03_AFx_UART3TXD()                 (CW_GPIOA->AFRL_f.AFR3  = 5)
#define PA03_AFx_GTIM2CH4()                 (CW_GPIOA->AFRL_f.AFR3  = 6)
#define PA03_AFx_ATIMCH3A()                 (CW_GPIOA->AFRL_f.AFR3  = 7)
#define PA04_AFx_GPIO()                     (CW_GPIOA->AFRL_f.AFR4  = 0)
#define PA04_AFx_MCOOUT()                   (CW_GPIOA->AFRL_f.AFR4  = 1)
#define PA04_AFx_UART2CTS()                 (CW_GPIOA->AFRL_f.AFR4  = 2)
#define PA04_AFx_HCLKOUT()                  (CW_GPIOA->AFRL_f.AFR4  = 4)
#define PA04_AFx_SPI1CS()                   (CW_GPIOA->AFRL_f.AFR4  = 5)
#define PA04_AFx_GTIM2ETR()                 (CW_GPIOA->AFRL_f.AFR4  = 6)
#define PA04_AFx_ATIMCH2A()                 (CW_GPIOA->AFRL_f.AFR4  = 7)
#define PA05_AFx_GPIO()                     (CW_GPIOA->AFRL_f.AFR5  = 0)
#define PA05_AFx_GTIM2ETR()                 (CW_GPIOA->AFRL_f.AFR5  = 1)
#define PA05_AFx_UART2RTS()                 (CW_GPIOA->AFRL_f.AFR5  = 2)
#define PA05_AFx_BTIM2TOGP()                (CW_GPIOA->AFRL_f.AFR5  = 4)
#define PA05_AFx_SPI1SCK()                  (CW_GPIOA->AFRL_f.AFR5  = 5)
#define PA05_AFx_GTIM2CH1()                 (CW_GPIOA->AFRL_f.AFR5  = 6)
#define PA05_AFx_ATIMCH1A()                 (CW_GPIOA->AFRL_f.AFR5  = 7)
#define PA06_AFx_GPIO()                     (CW_GPIOA->AFRL_f.AFR6  = 0)
#define PA06_AFx_UART2RXD()                 (CW_GPIOA->AFRL_f.AFR6  = 1)
#define PA06_AFx_UART2TXD()                 (CW_GPIOA->AFRL_f.AFR6  = 2)
#define PA06_AFx_VC1OUT()                   (CW_GPIOA->AFRL_f.AFR6  = 3)
#define PA06_AFx_BTIM2TOGN()                (CW_GPIOA->AFRL_f.AFR6  = 4)
#define PA06_AFx_SPI1MISO()                 (CW_GPIOA->AFRL_f.AFR6  = 5)
#define PA06_AFx_GTIM1CH1()                 (CW_GPIOA->AFRL_f.AFR6  = 6)
#define PA06_AFx_ATIMBK()                   (CW_GPIOA->AFRL_f.AFR6  = 7)
#define PA07_AFx_GPIO()                     (CW_GPIOA->AFRL_f.AFR7  = 0)
#define PA07_AFx_UART2TXD()                 (CW_GPIOA->AFRL_f.AFR7  = 1)
#define PA07_AFx_UART2RXD()                 (CW_GPIOA->AFRL_f.AFR7  = 2)
#define PA07_AFx_VC2OUT()                   (CW_GPIOA->AFRL_f.AFR7  = 3)
#define PA07_AFx_BTIM1TOGP()                (CW_GPIOA->AFRL_f.AFR7  = 4)
#define PA07_AFx_SPI1MOSI()                 (CW_GPIOA->AFRL_f.AFR7  = 5)
#define PA07_AFx_GTIM1CH2()                 (CW_GPIOA->AFRL_f.AFR7  = 6)
#define PA07_AFx_ATIMCH1B()                 (CW_GPIOA->AFRL_f.AFR7  = 7)
#define PA08_AFx_GPIO()                     (CW_GPIOA->AFRH_f.AFR8  = 0)
#define PA08_AFx_UART1RXD()                 (CW_GPIOA->AFRH_f.AFR8  = 1)
#define PA08_AFx_UART1TXD()                 (CW_GPIOA->AFRH_f.AFR8  = 2)
#define PA08_AFx_BTIM2TOGN()                (CW_GPIOA->AFRH_f.AFR8  = 3)
#define PA08_AFx_MCOOUT()                   (CW_GPIOA->AFRH_f.AFR8  = 4)
#define PA08_AFx_LVDOUT()                   (CW_GPIOA->AFRH_f.AFR8  = 5)
#define PA08_AFx_ATIMCH1A()                 (CW_GPIOA->AFRH_f.AFR8  = 7)
#define PA09_AFx_GPIO()                     (CW_GPIOA->AFRH_f.AFR9  = 0)
#define PA09_AFx_UART3TXD()                 (CW_GPIOA->AFRH_f.AFR9  = 1)
#define PA09_AFx_UART1RXD()                 (CW_GPIOA->AFRH_f.AFR9  = 2)
#define PA09_AFx_I2C1SCL()                  (CW_GPIOA->AFRH_f.AFR9  = 3)
#define PA09_AFx_BTIM1TOGP()                (CW_GPIOA->AFRH_f.AFR9  = 4)
#define PA09_AFx_SPI1CS()                   (CW_GPIOA->AFRH_f.AFR9  = 5)
#define PA09_AFx_UART3RXD()                 (CW_GPIOA->AFRH_f.AFR9  = 6)
#define PA09_AFx_ATIMCH2A()                 (CW_GPIOA->AFRH_f.AFR9  = 7)
#define PA10_AFx_GPIO()                     (CW_GPIOA->AFRH_f.AFR10 = 0)
#define PA10_AFx_UART3RXD()                 (CW_GPIOA->AFRH_f.AFR10 = 1)
#define PA10_AFx_UART1CTS()                 (CW_GPIOA->AFRH_f.AFR10 = 2)
#define PA10_AFx_I2C1SDA()                  (CW_GPIOA->AFRH_f.AFR10 = 3)
#define PA10_AFx_BTIM1TOGN()                (CW_GPIOA->AFRH_f.AFR10 = 4)
#define PA10_AFx_SPI1SCK()                  (CW_GPIOA->AFRH_f.AFR10 = 5)
#define PA10_AFx_SUART3TXD()                (CW_GPIOA->AFRH_f.AFR10 = 6)
#define PA10_AFx_ATIMCH3A()                 (CW_GPIOA->AFRH_f.AFR10 = 7)
#define PA11_AFx_GPIO()                     (CW_GPIOA->AFRH_f.AFR11 = 0)
#define PA11_AFx_UART3CTS()                 (CW_GPIOA->AFRH_f.AFR11 = 1)
#define PA11_AFx_UART1RTS()                 (CW_GPIOA->AFRH_f.AFR11 = 2)
#define PA11_AFx_VC1OUT()                   (CW_GPIOA->AFRH_f.AFR11 = 4)
#define PA11_AFx_SPI1MISO()                 (CW_GPIOA->AFRH_f.AFR11 = 5)
#define PA12_AFx_GPIO()                     (CW_GPIOA->AFRH_f.AFR12 = 0)
#define PA12_AFx_UART3RTS()                 (CW_GPIOA->AFRH_f.AFR12 = 1)
#define PA12_AFx_BTIMETR()                  (CW_GPIOA->AFRH_f.AFR12 = 2)
#define PA12_AFx_VC2OUT()                   (CW_GPIOA->AFRH_f.AFR12 = 4)
#define PA12_AFx_SPI1MOSI()                 (CW_GPIOA->AFRH_f.AFR12 = 5)
#define PA12_AFx_ATIMETR()                  (CW_GPIOA->AFRH_f.AFR12 = 7)
#define PA13_AFx_GPIO()                     (CW_GPIOA->AFRH_f.AFR13 = 0)
#define PA13_AFx_I2C1SDA()                  (CW_GPIOA->AFRH_f.AFR13 = 2)
#define PA13_AFx_UART1RXD()                 (CW_GPIOA->AFRH_f.AFR13 = 3)
#define PA13_AFx_UART2TXD()                 (CW_GPIOA->AFRH_f.AFR13 = 4)
#define PA13_AFx_IROUT()                    (CW_GPIOA->AFRH_f.AFR13 = 6)
#define PA14_AFx_GPIO()                     (CW_GPIOA->AFRH_f.AFR14 = 0)
#define PA14_AFx_UART3TXD()                 (CW_GPIOA->AFRH_f.AFR14 = 1)
#define PA14_AFx_I2C1SCL()                  (CW_GPIOA->AFRH_f.AFR14 = 2)
#define PA14_AFx_UART1TXD()                 (CW_GPIOA->AFRH_f.AFR14 = 3)
#define PA14_AFx_UART2RXD()                 (CW_GPIOA->AFRH_f.AFR14 = 4)
#define PA15_AFx_GPIO()                     (CW_GPIOA->AFRH_f.AFR15 = 0)
#define PA15_AFx_UART3RXD()                 (CW_GPIOA->AFRH_f.AFR15 = 1)
#define PA15_AFx_GTIM2CH1()                 (CW_GPIOA->AFRH_f.AFR15 = 2)
#define PA15_AFx_UART1RXD()                 (CW_GPIOA->AFRH_f.AFR15 = 3)
#define PA15_AFx_UART2TXD()                 (CW_GPIOA->AFRH_f.AFR15 = 4)
#define PA15_AFx_SPI1CS()                   (CW_GPIOA->AFRH_f.AFR15 = 5)
#define PA15_AFx_GTIM2ETR()                 (CW_GPIOA->AFRH_f.AFR15 = 6)
#define PA15_AFx_ATIMCH1B()                 (CW_GPIOA->AFRH_f.AFR15 = 7)

