hazy1k/CW32-48L/2.开发环境/CW32L031_StdPeriph_Lib（固件库）/Libraries/inc/cw32l031_gpio.h
#define PB00_AFx_GPIO()                     (CW_GPIOB->AFRL_f.AFR0  = 0)
#define PB00_AFx_UART2RXD()                 (CW_GPIOB->AFRL_f.AFR0  = 1)
#define PB00_AFx_UART1CTS()                 (CW_GPIOB->AFRL_f.AFR0  = 2)
#define PB00_AFx_UART2TXD()                 (CW_GPIOB->AFRL_f.AFR0  = 3)
#define PB00_AFx_BTIM1TOGN()                (CW_GPIOB->AFRL_f.AFR0  = 4)
#define PB00_AFx_HSIOSCOUT()                (CW_GPIOB->AFRL_f.AFR0  = 5)
#define PB00_AFx_GTIM1CH3()                 (CW_GPIOB->AFRL_f.AFR0  = 6)
#define PB00_AFx_ATIMCH2B()                 (CW_GPIOB->AFRL_f.AFR0  = 7)
#define PB01_AFx_GPIO()                     (CW_GPIOB->AFRL_f.AFR1  = 0)
#define PB01_AFx_UART2TXD()                 (CW_GPIOB->AFRL_f.AFR1  = 1)
#define PB01_AFx_UART1RTS()                 (CW_GPIOB->AFRL_f.AFR1  = 2)
#define PB01_AFx_UART2RXD()                 (CW_GPIOB->AFRL_f.AFR1  = 3)
#define PB01_AFx_BTIM3TOGP()                (CW_GPIOB->AFRL_f.AFR1  = 5)
#define PB01_AFx_GTIM1CH4()                 (CW_GPIOB->AFRL_f.AFR1  = 6)
#define PB01_AFx_ATIMCH3B()                 (CW_GPIOB->AFRL_f.AFR1  = 7)
#define PB02_AFx_GPIO()                     (CW_GPIOB->AFRL_f.AFR2  = 0)
#define PB02_AFx_UART2CTS()                 (CW_GPIOB->AFRL_f.AFR2  = 1)
#define PB02_AFx_UART1TXD()                 (CW_GPIOB->AFRL_f.AFR2  = 2)
#define PB02_AFx_HSEOUT()                   (CW_GPIOB->AFRL_f.AFR2  = 3)
#define PB02_AFx_UART1RXD()                 (CW_GPIOB->AFRL_f.AFR2  = 4)
#define PB02_AFx_BTIM3TOGN()                (CW_GPIOB->AFRL_f.AFR2  = 5)
#define PB02_AFx_GTIM1ETR()                 (CW_GPIOB->AFRL_f.AFR2  = 6)
#define PB02_AFx_ATIMCH1A()                 (CW_GPIOB->AFRL_f.AFR2  = 7)
#define PB03_AFx_GPIO()                     (CW_GPIOB->AFRL_f.AFR3  = 0)
#define PB03_AFx_UART3RTS()                 (CW_GPIOB->AFRL_f.AFR3  = 1)
#define PB03_AFx_GTIM2CH2()                 (CW_GPIOB->AFRL_f.AFR3  = 2)
#define PB03_AFx_UART1CTS()                 (CW_GPIOB->AFRL_f.AFR3  = 3)
#define PB03_AFx_UART2TXD()                 (CW_GPIOB->AFRL_f.AFR3  = 4)
#define PB03_AFx_SPI1SCK()                  (CW_GPIOB->AFRL_f.AFR3  = 5)
#define PB03_AFx_GTIM1ETR()                 (CW_GPIOB->AFRL_f.AFR3  = 6)
#define PB03_AFx_ATIMCH2B()                 (CW_GPIOB->AFRL_f.AFR3  = 7)
#define PB04_AFx_GPIO()                     (CW_GPIOB->AFRL_f.AFR4  = 0)
#define PB04_AFx_UART3CTS()                 (CW_GPIOB->AFRL_f.AFR4  = 1)
#define PB04_AFx_UART1RTS()                 (CW_GPIOB->AFRL_f.AFR4  = 3)
#define PB04_AFx_UART2CTS()                 (CW_GPIOB->AFRL_f.AFR4  = 4)
#define PB04_AFx_SPI1MISO()                 (CW_GPIOB->AFRL_f.AFR4  = 5)
#define PB04_AFx_GTIM1CH1()                 (CW_GPIOB->AFRL_f.AFR4  = 6)
#define PB04_AFx_ATIMCH3B()                 (CW_GPIOB->AFRL_f.AFR4  = 7)
#define PB05_AFx_GPIO()                     (CW_GPIOB->AFRL_f.AFR5  = 0)
#define PB05_AFx_AWTETR()                   (CW_GPIOB->AFRL_f.AFR5  = 3)
#define PB05_AFx_UART2RTS()                 (CW_GPIOB->AFRL_f.AFR5  = 4)
#define PB05_AFx_SPI1MOSI()                 (CW_GPIOB->AFRL_f.AFR5  = 5)
#define PB05_AFx_GTIM1CH2()                 (CW_GPIOB->AFRL_f.AFR5  = 6)
#define PB05_AFx_ATIMCH1A()                 (CW_GPIOB->AFRL_f.AFR5  = 7)
#define PB06_AFx_GPIO()                     (CW_GPIOB->AFRL_f.AFR6  = 0)
#define PB06_AFx_UART3TXD()                 (CW_GPIOB->AFRL_f.AFR6  = 1)
#define PB06_AFx_UART3RXD()                 (CW_GPIOB->AFRL_f.AFR6  = 2)
#define PB06_AFx_I2C1SCL()                  (CW_GPIOB->AFRL_f.AFR6  = 3)
#define PB06_AFx_GTIM1TOGP()                (CW_GPIOB->AFRL_f.AFR6  = 6)
#define PB06_AFx_ATIMCH2A()                 (CW_GPIOB->AFRL_f.AFR6  = 7)
#define PB07_AFx_GPIO()                     (CW_GPIOB->AFRL_f.AFR7  = 0)
#define PB07_AFx_UART3RXD()                 (CW_GPIOB->AFRL_f.AFR7  = 1)
#define PB07_AFx_UART3TXD()                 (CW_GPIOB->AFRL_f.AFR7  = 2)
#define PB07_AFx_I2C1SDA()                  (CW_GPIOB->AFRL_f.AFR7  = 3)
#define PB07_AFx_GTIM1TOGP()                (CW_GPIOB->AFRL_f.AFR7  = 6)
#define PB07_AFx_ATIMCH3A()                 (CW_GPIOB->AFRL_f.AFR7  = 7)
#define PB08_AFx_GPIO()                     (CW_GPIOB->AFRH_f.AFR8  = 0)
#define PB08_AFx_I2C1SCL()                  (CW_GPIOB->AFRH_f.AFR8  = 1)
#define PB08_AFx_UART1RXD()                 (CW_GPIOB->AFRH_f.AFR8  = 2)
#define PB08_AFx_UART1TXD()                 (CW_GPIOB->AFRH_f.AFR8  = 3)
#define PB08_AFx_GTIM1CH3()                 (CW_GPIOB->AFRH_f.AFR8  = 6)
#define PB08_AFx_ATIMETR()                  (CW_GPIOB->AFRH_f.AFR8  = 7)
#define PB09_AFx_GPIO()                     (CW_GPIOB->AFRH_f.AFR9  = 0)
#define PB09_AFx_I2C1SDA()                  (CW_GPIOB->AFRH_f.AFR9  = 1)
#define PB09_AFx_UART1TXD()                 (CW_GPIOB->AFRH_f.AFR9  = 2)
#define PB09_AFx_UART1RXD()                 (CW_GPIOB->AFRH_f.AFR9  = 3)
#define PB09_AFx_IROUT()                    (CW_GPIOB->AFRH_f.AFR9  = 4)
#define PB09_AFx_GTIM1CH4()                 (CW_GPIOB->AFRH_f.AFR9  = 6)
#define PB09_AFx_ATIMBK()                   (CW_GPIOB->AFRH_f.AFR9  = 7)
#define PB10_AFx_GPIO()                     (CW_GPIOB->AFRH_f.AFR10 = 0)
#define PB10_AFx_UART2RTS()                 (CW_GPIOB->AFRH_f.AFR10 = 1)
#define PB10_AFx_UART1RXD()                 (CW_GPIOB->AFRH_f.AFR10 = 2)
#define PB10_AFx_I2C1SCL()                  (CW_GPIOB->AFRH_f.AFR10 = 3)
#define PB10_AFx_UART1TXD()                 (CW_GPIOB->AFRH_f.AFR10 = 4)
#define PB10_AFx_GTIM2CH3()                 (CW_GPIOB->AFRH_f.AFR10 = 6)
#define PB10_AFx_ATIMCH2A()                 (CW_GPIOB->AFRH_f.AFR10 = 7)
#define PB11_AFx_GPIO()                     (CW_GPIOB->AFRH_f.AFR11 = 0)
#define PB11_AFx_LSIOUT()                   (CW_GPIOB->AFRH_f.AFR11 = 1)
#define PB11_AFx_I2C1SDA()                  (CW_GPIOB->AFRH_f.AFR11 = 3)
#define PB11_AFx_BTIMETR()                  (CW_GPIOB->AFRH_f.AFR11 = 5)
#define PB11_AFx_GTIM2CH4()                 (CW_GPIOB->AFRH_f.AFR11 = 6)
#define PB11_AFx_ATIMCH3A()                 (CW_GPIOB->AFRH_f.AFR11 = 7)
#define PB12_AFx_GPIO()                     (CW_GPIOB->AFRH_f.AFR12 = 0)
#define PB12_AFx_GTIM2TOGN()                (CW_GPIOB->AFRH_f.AFR12 = 1)
#define PB12_AFx_LSEOUT()                   (CW_GPIOB->AFRH_f.AFR12 = 3)
#define PB12_AFx_SPI1CS()                   (CW_GPIOB->AFRH_f.AFR12 = 5)
#define PB12_AFx_GTIM1TOGN()                (CW_GPIOB->AFRH_f.AFR12 = 6)
#define PB12_AFx_ATIMBK()                   (CW_GPIOB->AFRH_f.AFR12 = 7)
#define PB13_AFx_GPIO()                     (CW_GPIOB->AFRH_f.AFR13 = 0)
#define PB13_AFx_GTIM2TOGP()                (CW_GPIOB->AFRH_f.AFR13 = 1)
#define PB13_AFx_SPI1SCK()                  (CW_GPIOB->AFRH_f.AFR13 = 5)
#define PB13_AFx_GTIM1TOGP()                (CW_GPIOB->AFRH_f.AFR13 = 6)
#define PB13_AFx_ATIMCH1B()                 (CW_GPIOB->AFRH_f.AFR13 = 7)
#define PB14_AFx_GPIO()                     (CW_GPIOB->AFRH_f.AFR14 = 0)
#define PB14_AFx_GTIM2CH1()                 (CW_GPIOB->AFRH_f.AFR14 = 1)
#define PB14_AFx_SPI1MISO()                 (CW_GPIOB->AFRH_f.AFR14 = 5)
#define PB14_AFx_RTCOUT()                   (CW_GPIOB->AFRH_f.AFR14 = 6)
#define PB14_AFx_ATIMCH2B()                 (CW_GPIOB->AFRH_f.AFR14 = 7)
#define PB15_AFx_GPIO()                     (CW_GPIOB->AFRH_f.AFR15 = 0)
#define PB15_AFx_GTIM2CH2()                 (CW_GPIOB->AFRH_f.AFR15 = 1)
#define PB15_AFx_BTIM2TOGP()                (CW_GPIOB->AFRH_f.AFR15 = 3)
#define PB15_AFx_SPI1MOSI()                 (CW_GPIOB->AFRH_f.AFR15 = 5)
#define PB15_AFx_RTC1Hz()                   (CW_GPIOB->AFRH_f.AFR15 = 6)
#define PB15_AFx_ATIMCH3B()                 (CW_GPIOB->AFRH_f.AFR15 = 7)

#define PC13_AFx_GPIO()                     (CW_GPIOC->AFRH_f.AFR13 = 0)
#define PC13_AFx_UART1TXD()                 (CW_GPIOC->AFRH_f.AFR13 = 1)
#define PC13_AFx_RTC1Hz()                   (CW_GPIOC->AFRH_f.AFR13 = 2)
#define PC13_AFx_UART1CTS()                 (CW_GPIOC->AFRH_f.AFR13 = 3)
#define PC13_AFx_RTCOUT()                   (CW_GPIOC->AFRH_f.AFR13 = 4)
#define PC13_AFx_BTIMETR()                  (CW_GPIOC->AFRH_f.AFR13 = 5)
#define PC13_AFx_RTCTAMP()                  (CW_GPIOC->AFRH_f.AFR13 = 7)
#define PC14_AFx_GPIO()                     (CW_GPIOC->AFRH_f.AFR14 = 0)
#define PC14_AFx_AWTETR()                   (CW_GPIOC->AFRH_f.AFR14 = 1)
#define PC14_AFx_UART2TXD()                 (CW_GPIOC->AFRH_f.AFR14 = 2)
#define PC14_AFx_UART1RTS()                 (CW_GPIOC->AFRH_f.AFR14 = 3)
#define PC14_AFx_BTIM2TOGN()                (CW_GPIOC->AFRH_f.AFR14 = 4)
#define PC14_AFx_UART2RXD()                 (CW_GPIOC->AFRH_f.AFR14 = 5)
#define PC15_AFx_GPIO()                     (CW_GPIOC->AFRH_f.AFR15 = 0)
#define PC15_AFx_HSEOUT()                   (CW_GPIOC->AFRH_f.AFR15 = 1)
#define PC15_AFx_UART2RXD()                 (CW_GPIOC->AFRH_f.AFR15 = 2)
#define PC15_AFx_MCOOUT()                   (CW_GPIOC->AFRH_f.AFR15 = 3)
#define PC15_AFx_BTIM2TOGP()                (CW_GPIOC->AFRH_f.AFR15 = 4)
#define PC15_AFx_UART2TXD()                 (CW_GPIOC->AFRH_f.AFR15 = 5)
#define PC15_AFx_UART1RXD()                 (CW_GPIOC->AFRH_f.AFR15 = 6)

