hazy1k/CW32-48L/2.开发环境/CW32L031_StdPeriph_Lib（固件库）/Libraries/inc/cw32l031_gpio.h
#define PF00_AFx_GPIO()                     (CW_GPIOF->AFRL_f.AFR0  = 0)
#define PF00_AFx_AWTETR()                   (CW_GPIOF->AFRL_f.AFR0  = 1)
#define PF00_AFx_UART3TXD()                 (CW_GPIOF->AFRL_f.AFR0  = 2)
#define PF00_AFx_I2C1SDA()                  (CW_GPIOF->AFRL_f.AFR0  = 3)
#define PF00_AFx_BTIM1TOGP()                (CW_GPIOF->AFRL_f.AFR0  = 4)
#define PF00_AFx_UART3RXD()                 (CW_GPIOF->AFRL_f.AFR0  = 5)
#define PF00_AFx_GTIM2TOGN()                (CW_GPIOF->AFRL_f.AFR0  = 6)
#define PF01_AFx_GPIO()                     (CW_GPIOF->AFRL_f.AFR1  = 0)
#define PF01_AFx_LSEOUT()                   (CW_GPIOF->AFRL_f.AFR1  = 1)
#define PF01_AFx_UART3RXD()                 (CW_GPIOF->AFRL_f.AFR1  = 2)
#define PF01_AFx_I2C1SCL()                  (CW_GPIOF->AFRL_f.AFR1  = 3)
#define PF01_AFx_BTIM1TOGN()                (CW_GPIOF->AFRL_f.AFR1  = 4)
#define PF01_AFx_UART3TXD()                 (CW_GPIOF->AFRL_f.AFR1  = 5)
#define PF01_AFx_GTIM2TOGP()                (CW_GPIOF->AFRL_f.AFR1  = 6)
#define PF06_AFx_GPIO()                     (CW_GPIOF->AFRL_f.AFR6  = 0)
#define PF06_AFx_UART3CTS()                 (CW_GPIOF->AFRL_f.AFR6  = 1)
#define PF06_AFx_I2C1SCL()                  (CW_GPIOF->AFRL_f.AFR6  = 2)
#define PF06_AFx_UART2CTS()                 (CW_GPIOF->AFRL_f.AFR6  = 4)
#define PF06_AFx_BTIM3TOGP()                (CW_GPIOF->AFRL_f.AFR6  = 7)
#define PF07_AFx_GPIO()                     (CW_GPIOF->AFRL_f.AFR7  = 0)
#define PF07_AFx_UART3RTS()                 (CW_GPIOF->AFRL_f.AFR7  = 1)
#define PF07_AFx_I2C1SDA()                  (CW_GPIOF->AFRL_f.AFR7  = 2)
#define PF07_AFx_UART2RTS()                 (CW_GPIOF->AFRL_f.AFR7  = 4)
#define PF07_AFx_BTIM3TOGN()                (CW_GPIOF->AFRL_f.AFR7  = 7)

//============================================================

#ifdef __cplusplus
}
#endif

#endif
